//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2016 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//  File History
//
//  Rev. 1.01
//    Bug Fix:  Draft template v0.1.
//    Reason:   
//    Auditor:  Kasber Chen
//    Date:     Jan/17/2017
//
//  Rev. 1.00
//    Bug Fix:  Draft template.
//    Reason:   
//    Auditor:  Kasber Chen
//    Date:     Dec/16/2016
//
//****************************************************************************
﻿//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
//
// Module Name:
//
//   ProcessorSetupStrings.uni
//
// Abstract:
//
//   String definitions for Processor Setup formset.
//
// Revision History:
//
// --*/

/=#

#langdef   en-US "English"

//
// Advanced - Processor Configuration
//
#string STR_PROCESSOR_CONFIG_FORM_TITLE #language en-US "Processor Configuration"
#string STR_PROCESSOR_CONFIG_FORM_HELP  #language en-US "Displays and provides option to change the Processor Settings"

#string STR_NULL_PROCACCESS_STRING      #language en-US ""
#string STR_8                           #language en-US  "8"
#string STR_16                          #language en-US  "16"
#string STR_24              #language en-US  "24"
#string STR_32              #language en-US  "32"
#string STR_40              #language en-US  "40"
#string STR_48              #language en-US  "48"
#string STR_56              #language en-US  "56"
#string STR_64              #language en-US  "64"
#string STR_72              #language en-US  "72"
#string STR_80              #language en-US  "80"
#string STR_88              #language en-US  "88"
#string STR_96              #language en-US  "96"
#string STR_104              #language en-US  "104"
#string STR_112              #language en-US  "112"

#string STR_CPU_BSP_REVISION_PROMPT      #language en-US "Processor BSP Revision"
#string STR_CPU_BSP_REVISION_VALUE       #language en-US ""

#string STR_PROCESSOR_SOCKET_STRING     #language en-US "Processor Socket"
#string STR_PROCESSOR_SOCKET_VALUE      #language en-US "CPU1      |  CPU2    "
#string STR_PROCESSOR2_3_SOCKET_VALUE   #language en-US "CPU3      |  CPU4    "

#string STR_PROCESSOR_ID_STRING         #language en-US "Processor ID"
#string STR_PROCESSOR_ID_VALUE          #language en-US ""
#string STR_PROCESSOR2_3_ID_VALUE       #language en-US ""

#string STR_PROCESSOR_FREQ_STRING       #language en-US "Processor Frequency"
#string STR_PROCESSOR_FREQ_VALUE        #language en-US ""
#string STR_PROCESSOR2_3_FREQ_VALUE     #language en-US ""

#string STR_PROCESSOR_MAX_RATIO_STRING       #language en-US "Processor Max Ratio"
#string STR_PROCESSOR_MAX_RATIO_VALUE        #language en-US ""
#string STR_PROCESSOR2_3_MAX_RATIO_VALUE     #language en-US ""

#string STR_PROCESSOR_MIN_RATIO_STRING       #language en-US "Processor Min Ratio"
#string STR_PROCESSOR_MIN_RATIO_VALUE        #language en-US ""
#string STR_PROCESSOR2_3_MIN_RATIO_VALUE     #language en-US ""

#string STR_PROCESSOR_MICROCODE_STRING  #language en-US "Microcode Revision"
#string STR_PROCESSOR_MICROCODE_VALUE   #language en-US ""
#string STR_PROCESSOR2_3_MICROCODE_VALUE  #language en-US ""

#string STR_PROCESSOR_L1_CACHE_STRING   #language en-US "L1 Cache RAM"
#string STR_PROCESSOR_L1_CACHE_VALUE    #language en-US ""
#string STR_PROCESSOR2_3_L1_CACHE_VALUE #language en-US ""

#string STR_PROCESSOR_L2_CACHE_STRING   #language en-US "L2 Cache RAM"
#string STR_PROCESSOR_L2_CACHE_VALUE    #language en-US ""
#string STR_PROCESSOR2_3_L2_CACHE_VALUE #language en-US ""

#string STR_PROCESSOR_L3_CACHE_STRING   #language en-US "L3 Cache RAM"
#string STR_PROCESSOR_L3_CACHE_VALUE    #language en-US ""
#string STR_PROCESSOR2_3_L3_CACHE_VALUE #language en-US ""

#string STR_4096K                       #language en-US "4096K"

#string STR_4M                          #language en-US "4M"
#string STR_8M                          #language en-US "8M"
#string STR_16M                         #language en-US "16M"
#string STR_32M                         #language en-US "32M"
#string STR_64M                         #language en-US "64M"
#string STR_128M                        #language en-US "128M"
#string STR_256M                        #language en-US "256M"
#string STR_512M                        #language en-US "512M"
#string STR_1G                          #language en-US "1G"
#string STR_2G                          #language en-US "2G"
#string STR_3G                          #language en-US "3G"
#string STR_4G                          #language en-US "4G"
#string STR_16G                         #language en-US "16G"
#string STR_64G                         #language en-US "64G"
#string STR_128G                        #language en-US "128G"
#string STR_256G                        #language en-US "256G"
#string STR_512G                        #language en-US "512G"
#string STR_1024G                       #language en-US "1024G"
#string STR_16875G                      #language en-US "16875G"
#string STR_6875G                       #language en-US "6875G"
#string STR_26875G                      #language en-US "26875G"
#string STR_225G                        #language en-US "225G"
#string STR_125G                        #language en-US "125G"
#string STR_325G                        #language en-US "325G"
#string STR_1T                          #language en-US "1T"
#string STR_4T                          #language en-US "4T"
#string STR_16T                         #language en-US "16T"
#string STR_24T                         #language en-US "24T"
#string STR_56T                         #language en-US "56T"
#string STR_40T                         #language en-US "40T"


#string STR_PROCESSOR_IED_PROMPT        #language en-US "Intel Enhanced Debug"
#string STR_PROCESSOR_IED_HELP          #language en-US "Option to disable/enable Intel Enhanced Debug support"

#string STR_PROCESSOR_IED_TRACE_PROMPT  #language en-US "IED Trace memory"
#string STR_PROCESSOR_IED_TRACE_HELP    #language en-US "Option to allocate memory for PSMI trace"

#string STR_PROCESSOR_TSEG_PROMPT       #language en-US "TSEG Smram Size"
#string STR_PROCESSOR_TSEG_HELP         #language en-US "Option to change the size of SMRAM for TSEG"

#string STR_PROCESSOR_CORE_RATIO        #language en-US "CPU Core Flex Ratio"
#string STR_PROCESSOR_CORE_RATIO_HELP   #language en-US "Non-Turbo Mode Processor Core Ratio Multiplier"

#string STR_PROCESSOR_TDC_OVERRIDE      #language en-US "TDC Limit Override"
#string STR_PROCESSOR_TDC_OVERRIDE_HELP #language en-US "Turbo-XE Mode Processor TDC Limit Override"

#string STR_PROCESSOR_TDC               #language en-US "TDC Limit"
#string STR_PROCESSOR_TDC_HELP          #language en-US "Turbo-XE Mode Processor TDC Limit in 1/8 A granularity"

#string STR_PROCESSOR_TDP_OVERRIDE      #language en-US "TDP Limit Override"
#string STR_PROCESSOR_TDP_OVERRIDE_HELP #language en-US "Turbo-XE Mode Processor TDP Limit Override"

#string STR_PROCESSOR_TDP               #language en-US "TDP Limit"
#string STR_PROCESSOR_TDP_HELP          #language en-US "Turbo-XE Mode Processor TDP Limit in 1/8 W granularity"

#string STR_MTRR_DEFAULT_TYPE_PROMPT    #language en-US "MTRR Default as uncacheable."
#string STR_MTRR_DEFAULT_TYPE_HELP      #language en-US "EFI_CACHE_IA32_MTRR_DEF_TYPE msr(2FF) as uncacheable"

#string STR_LTSX                          #language en-US "Enable Intel(R) TXT"
#string STR_LTSX_HELP                     #language en-US "Enables Intel(R) TXT."

//SMCPKG_SUPPORT        #string STR_PROCESSOR_VMX               #language en-US "VMX"
//SMCPKG_SUPPORT        #string STR_PROCESSOR_VMX_HELP          #language en-US "Enables the Vanderpool Technology, takes effect after reboot."
#string STR_PROCESSOR_VMX               #language en-US "Intel Virtualization Technology"       //SMCPKG_SUPPORT
#string STR_PROCESSOR_VMX_HELP          #language en-US "When enabled, a VMM can utilize the additional hardware capabilities provided by Vanderpool Technology"        //SMCPKG_SUPPORT

#string STR_LT                          #language en-US "Enable SMX"
#string STR_LT_HELP                     #language en-US "Enables Safer Mode Extensions."

#string STR_PPIN_CONTROL_PROMPT         #language en-US "PPIN Control"
#string STR_PPIN_CONTROL_HELP           #language en-US "Unlock and Enable/Disable PPIN Control"

#string STR_LOCK_CHIPSET_PROMPT         #language en-US "Lock Chipset"
#string STR_LOCK_CHIPSET_HELP           #language en-US "Lock or Unlock chipset"

#string STR_BIOS_ACM_ERROR_RESET_PROMPT #language en-US "BIOS ACM Error Reset"
#string STR_BIOS_ACM_ERROR_RESET_HELP   #language en-US "When BIOS ACM error occurs, If enabled, it will disable TXT and Reset system (Restart system in non-TXT mode). If disabled, it will Ignore errors, and continue booting with no further BIOSACM being called"

#string STR_SKIP_STOPPBET_PROMPT         #language en-US "Skip StopPbet"
#string STR_SKIP_STOPPBET_HELP           #language en-US "Enables Skip StopPbet"

#string STR_UNLOCK_ENABLE               #language en-US "Unlock/Enable"
#string STR_UNLOCK_DISABLE              #language en-US "Unlock/Disable"

#string STR_PROCESSOR_XTPR              #language en-US "xTPR"
#string STR_PROCESSOR_XTPR_HELP         #language en-US "Enables/Disables sending of xTPR messages on the system bus"

#string STR_PROCESSOR0_HT               #language en-US "Hyper-Threading [ALL]"

#string STR_PROCESSOR_HT_HELP           #language en-US "Enables Hyper Threading (Software Method to Enable/Disable Logical Processor threads."

#string STR_LIMIT_CPUID_PROMPT          #language en-US "Max CPUID Value Limit"
#string STR_LIMIT_CPUID_HELP            #language en-US "This should be enabled in order to boot legacy OSes that cannot support CPUs with extended CPUID functions."

#string STR_EXECUTE_DISABLE_BIT_PROMPT  #language en-US "Execute Disable Bit"
#string STR_EXECUTE_DISABLE_BIT_HELP    #language en-US "When disabled, forces the XD feature flag to always return 0."

#string STR_MWAIT                       #language en-US "Monitor/Mwait"
#string STR_MWAIT_HELP                  #language en-US "Enable or Disable the Monitor/Mwait instruction"


#string STR_FAST_STR                    #language en-US "Fast String"
#string STR_FAST_STR_HELP               #language en-US "When enabled, enable fast strings for REP MOVS/STOS"

#string STR_MCH_STR                     #language en-US "Machine Check"
#string STR_MCH_STR_HELP                #language en-US "Enable or Disable the Machine Check"

#string STR_THREESTRIKETIMER_DISABLE          #language en-US "3StrikeTimer"
#string STR_THREESTRIKETIMER_DISABLE_HELP     #language en-US "The 3 strike counter can be turned off by writing into the MISC_FEATURE_CONTROL_DISABLE_THREE_STRIKE_CNT(MSR 0x01a4)."
#string STR_PROCESSOR_I_TURBO_MODE      #language en-US "Performance/Watt"
#string STR_PROCESSOR_I_TURBO_MODE_HELP #language en-US "When Power Optimized is selected Intel Turbo Boost Technology engages after performance state P0 is sustained for more than 2 seconds. When Traditional is selected Intel Turbo Boost Technology is engaged even for P0 requests less than 2 seconds."

#string STR_POWER_OPTIMIZED             #language en-US "Power Optimized"
#string STR_TRADITIONAL                 #language en-US "Traditional"

#string STR_PROCESSOR_XE                #language en-US "Extreme Enable (XE)"
#string STR_PROCESSOR_XE_HELP           #language en-US "When XE (eXtreme) is enabled, BIOS could program processor multiplier greater than MAX ratio."

#string STR_PROCESSOR_X2APIC            #language en-US "Extended APIC"
#string STR_PROCESSOR_X2APIC_HELP       #language en-US "Enable/disable extended APIC support"
#string STR_FORCE_X2APICIDS_PROMPT      #language en-US "Force x2APIC IDs"
#string STR_FORCE_X2APICIDS_PROMPT_HELP #language en-US "Force use of > 8-bit APIC IDs"

#string STR_PROCESSOR_AES               #language en-US "AES-NI"
#string STR_PROCESSOR_AES_HELP          #language en-US "Enable/disable AES-NI support"

#string STR_BSP_SELECT                  #language en-US "Bsp Selection"
#string STR_BSP_SELECT_HELP             #language en-US "Choose the method to select BSP"
#string STR_SOCKET0                     #language en-US "Socket 0"
#string STR_SOCKET1                     #language en-US "Socket 1"
#string STR_SOCKET2                     #language en-US "Socket 2"
#string STR_SOCKET3                     #language en-US "Socket 3"

#string STR_PROCESSOR_HARDWARE_PREFETCHER             #language en-US "Hardware Prefetcher"
#string STR_PROCESSOR_HARDWARE_PREFETCHER_HELP        #language en-US "= MLC Streamer Prefetcher (MSR 1A4h Bit[0])"

#string STR_PROCESSOR_ADJACENT_CACHE_PREFETCHER       #language en-US "Adjacent Cache Prefetch"
#string STR_PROCESSOR_ADJACENT_CACHE_PREFETCHER_HELP  #language en-US "= MLC Spatial Prefetcher (MSR 1A4h Bit[1])"

#string STR_PROCESSOR_DCU_STREAMER_PREFETCHER         #language en-US "DCU Streamer Prefetcher"
#string STR_PROCESSOR_DCU_STREAMER_PREFETCHER_HELP    #language en-US "DCU streamer prefetcher is an L1 data cache prefetcher (MSR 1A4h [2])."
#string STR_PROCESSOR_DCU_IP_PREFETCHER               #language en-US "DCU IP Prefetcher"
#string STR_PROCESSOR_DCU_IP_PREFETCHER_HELP          #language en-US "DCU IP prefetcher is an L1 data cache prefetcher (MSR 1A4h [3])."

#string STR_PROCESSOR_VERSION_SOCKET0_STRING  #language en-US "Processor 0 Version"
#string STR_PROCESSOR_VERSION_SOCKET0_VALUE   #language en-US "Not Present"
#string STR_PROCESSOR_VERSION_SOCKET0_VALUE2  #language en-US ""
#string STR_PROCESSOR_VERSION_SOCKET1_STRING  #language en-US "Processor 1 Version"
#string STR_PROCESSOR_VERSION_SOCKET1_VALUE   #language en-US "Not Present"
#string STR_PROCESSOR_VERSION_SOCKET1_VALUE2  #language en-US ""

#string STR_PROCESSOR_VERSION_SOCKET2_STRING  #language en-US "Processor 2 Version"
#string STR_PROCESSOR_VERSION_SOCKET2_VALUE   #language en-US "Not Present"
#string STR_PROCESSOR_VERSION_SOCKET2_VALUE2  #language en-US ""
#string STR_PROCESSOR_VERSION_SOCKET3_STRING  #language en-US "Processor 3 Version"
#string STR_PROCESSOR_VERSION_SOCKET3_VALUE   #language en-US "Not Present"
#string STR_PROCESSOR_VERSION_SOCKET3_VALUE2  #language en-US ""

#string STR_UPBOOT_SELECT               #language en-US "UP Boot Selection"
#string STR_UPBOOT_SELECT_HELP          #language en-US "Choose UP boot mode in DP system. Note: it only works when DP are populated"

#string STR_PROCESSOR_MSR_LOCK          #language en-US "MSR Lock Control"
#string STR_PROCESSOR_MSR_LOCK_HELP     #language en-US "Enable - MSR 3Ah, MSR 0E2h and CSR 80h will locked. Power Good reset is needed to remove lock bits."

#string STR_DEBUG_INTERFACE             #language en-US "DEBUG INTERFACE"
#string STR_DEBUG_INTERFACE_HELP        #language en-US "MSR 0C80h bit[0], When set enables the debug features."

#string STR_CQE_FUSE_OVERRIDE           #language en-US "CQE Fuse Override"
#string STR_CQE_FUSE_OVERRIDE_HELP      #language en-US "MSR 95h bit[0]"
#string STR_DEFAULT                     #language en-US "Keep Default"
#string STR_0                           #language en-US "0"
#string STR_1                           #language en-US "1"

#string STR_LLC_PREFETCH_PROMPT         #language en-US "LLC Prefetch"
#string STR_LLC_PREFETCH_HELP           #language en-US "Enable/Disable LLC Prefetch on all threads"

#string STR_FORCE_PHYSICAL_MODE_PROMPT  #language en-US "APIC Physical Mode"
#string STR_FORCE_PHYSICAL_MODE_HELP    #language en-US "Enalbe/Disable the APIC physical destination mode"

#string STR_VIRTUAL_WIRE_MODE_PROMPT    #language en-US "Virtual Wire Mode"
#string STR_VIRTUAL_WIRE_MODE_HELP      #language en-US "Select virtual wire interrupt mode"
#string STR_VIRTUAL_WIRE_A              #language en-US "Virtual Wire A"
#string STR_VIRTUAL_WIRE_B              #language en-US "Virtual Wire B"

#string STR_PECIDNSTREAM_PROMPT         #language en-US "Down Stream PECI"
#string STR_PECIDNSTREAM_HELP           #language en-US "Enable PCIe Down Stream PECI Write"

#string STR_PECITRUST_PROMPT         #language en-US "PECI IN TRUST BIT ENABLE"
#string STR_PECITRUST_HELP           #language en-US "PECI IN TRUST BIT ENABLE""

#string STR_PROCESSOR_DCU_MODE          #language en-US "DCU Mode"
#string STR_PROCESSOR_DCU_MODE_HELP     #language en-US "MSR 31h Bit[0] - A write of 1 selects the DCU mode as 16KB 4-way with ECC."
#string STR_32K_8WAY_WITHOUT_ECC        #language en-US "32KB 8Way Without ECC"
#string STR_16K_4WAY_WITH_ECC           #language en-US "16KB 4Way With ECC"

#string STR_ALLOW_MIXED_RATIO_PROMPT            #language en-US "Allow mixed freq among CPUs"
#string STR_ALLOW_MIXED_RATIO_HELP              #language en-US "Keep (mixed) power-on freq of each CPU socket.  Caution: This is for Intel PPV test only"

#string STR_PROCESSOR_RATIO_OVERRIDE            #language en-US "CPU Flex Ratio Override"
#string STR_PROCESSOR_RATIO_OVERRIDE_HELP       #language en-US "Enable/Disable CPU Flex Ratio Programming"

#string STR_CHECK_BIST_RESULT_PROMPT            #language en-US "Check CPU BIST Result"
#string STR_CHECK_BIST_RESULT_HELP              #language en-US "Disable failed BIST core when enable, otherwise, ignore BIST result"

// TBD - Have to move this to PowerManagement.uni

#string STR_OUTPUT_ONLY                           #language en-US "Output-only"
#string STR_INPUT_ONLY                            #language en-US "Input-only"

// End of PowerManagement.uni

// need to re-aarange power management options. not sure where these have to go

#string STR_IIO_LLC_WAYS_PROMPT                 #language en-US "IIO LLC Ways [22:0](Hex)"
#string STR_IIO_LLC_WAYS_HELP                   #language en-US "MSR CBO_SLICE0_CR_IIO_LLC_WAYS bitmask"

#string STR_EXPANDED_IIO_LLC_WAYS_PROMPT        #language en-US "Expanded IIO LLC Ways [10:0](Hex)"
#string STR_EXPANDED_IIO_LLC_WAYS_HELP          #language en-US "MSR INGRESS_SPARE bitmask[10:0]"

#string STR_REMOTE_WAYS_PROMPT                  #language en-US "Remote Ways [22:12](Hex)"
#string STR_REMOTE_WAYS_HELP                    #language en-US "MSR INGRESS_SPARE bitmask[26:16], Value 0 means no override"

#string STR_QLRU_CFG_HI_PROMPT                  #language en-US "QLRU Config [63:32](Hex)"
#string STR_QLRU_CFG_LO_PROMPT                  #language en-US "QLRU Config [31:0](Hex)"
#string STR_QLRU_CFG_HELP                       #language en-US "VIRTUAL_MSR_CR_QLRU_CONFIG bitmask"


#string STR_TARGETED_SMI                        #language en-US "Targeted Smi"
#string STR_TARGETED_SMI_HELP                   #language en-US "Enable or Disable Targeted Smi Feature"

#string STR_ESMM_SAVE_STATE                     #language en-US "eSMM Save State"
#string STR_ESMM_SAVE_STATE_HELP                #language en-US "Enable or Disable the eSMM Save State Feature"

#string STR_SMBUS_ERROR_RECOVERY                #language en-US "Smbus Error Recovery"
#string STR_SMBUS_ERROR_RECOVERY_HELP           #language en-US "Enable or Disable Smbus Error Recovery"

//PER SOCKET SETUP OPTIONS
#string STR_PERSOCKET_CONFIG_FORM_TITLE         #language en-US "Per-Socket Configuration"
#string STR_PERSOCKET_CONFIG_FORM_HELP          #language en-US "Change Per-Socket Settings"
#string STR_SOCKET_CONFIG_FORM_TITLE_0          #language en-US "CPU Socket 0 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_1          #language en-US "CPU Socket 1 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_2          #language en-US "CPU Socket 2 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_3          #language en-US "CPU Socket 3 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_4          #language en-US "CPU Socket 4 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_5          #language en-US "CPU Socket 5 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_6          #language en-US "CPU Socket 6 Configuration"
#string STR_SOCKET_CONFIG_FORM_TITLE_7          #language en-US "CPU Socket 7 Configuration"

#string STR_CORE_DISABLE_BITMAP_PROMPT_0        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_1        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_2        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_3        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_4        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_5        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_6        #language en-US "Core Disable Bitmap(Hex)"
#string STR_CORE_DISABLE_BITMAP_PROMPT_7        #language en-US "Core Disable Bitmap(Hex)"
#string STR_STR_CORE_DISABLE_BITMAP_HELP        #language en-US "0: Enable all cores. 3fff: Disable all cores"

#string STR_IOT_EN_PROMPT_0                     #language en-US "IOT Cfg"
#string STR_IOT_EN_PROMPT_1                     #language en-US "IOT Cfg"
#string STR_IOT_EN_PROMPT_2                     #language en-US "IOT Cfg"
#string STR_IOT_EN_PROMPT_3                     #language en-US "IOT Cfg"
#string STR_IOT_EN_PROMPT_4                     #language en-US "IOT Cfg"
#string STR_IOT_EN_PROMPT_5                     #language en-US "IOT Cfg"
#string STR_IOT_EN_PROMPT_6                     #language en-US "IOT Cfg"
#string STR_IOT_EN_PROMPT_7                     #language en-US "IOT Cfg"
#string STR_IOT_EN_HELP                         #language en-US "IOT/OCLA Config"

#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_0           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_1           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_2           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_3           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_4           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_5           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_6           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_PROMPT_7           #language en-US " OCLA Tor IDs"
#string STR_OCLA_MAX_TOR_ENTRY_HELP               #language en-US "Valid from 0 to 17 (11 hex)"

#string STR_OCLA_WAY_PROMPT_0                     #language en-US " Num of OCLA ways"
#string STR_OCLA_WAY_PROMPT_1                     #language en-US " Num of OCLA Ways"
#string STR_OCLA_WAY_PROMPT_2                     #language en-US " Num of OCLA Ways"
#string STR_OCLA_WAY_PROMPT_3                     #language en-US " Num of OCLA Ways"
#string STR_OCLA_WAY_PROMPT_4                     #language en-US " Num of OCLA Ways"
#string STR_OCLA_WAY_PROMPT_5                     #language en-US " Num of OCLA Ways"
#string STR_OCLA_WAY_PROMPT_6                     #language en-US " Num of OCLA Ways"
#string STR_OCLA_WAY_PROMPT_7                     #language en-US " Num of OCLA Ways"
#string STR_OCLA_WAY_HELP                         #language en-US "Number of LLC Ways for IOT OCLA"

#string STR_NO                                    #language en-US "No"
#string STR_YES                                   #language en-US "Yes"

//HWPM strings

#string STR_PCH_TRACE_HUB               #language en-US "TRACE HUB STH ACPIBAR BASE"
#string STR_PCH_TRACE_HUB_HELP          #language en-US "Enable: Set PCH_TRACE_HUB_FW_BASE_ADDRESS in MSR_TRACE_HUB_STH_ACPIBAR_BASE (MSR 80h)."

//
// End of file
//
